app/controllers/notes_controller.rb

  def index
    @notes = Note.all
---
SELECT "notes".* FROM "notes"

  def show
	@note = Note.find_by slug: params[:slug]
---
SELECT  "notes".* FROM "notes" WHERE "notes"."slug" = $1 LIMIT $2  [["slug", "IWi456aTkPPzQVxwQ1Y2HQ"], ["LIMIT", 1]]

  def create
    @note = Note.new(note_params)

      if @note.save
---
INSERT INTO "notes" ("content", "created_at", "updated_at", "slug") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "asdf"], ["created_at", "2017-10-30 19:15:27.304734"], ["updated_at", "2017-10-30 19:15:27.304734"], ["slug", "H4qbH45bsOm2FKaBkbhWeg"]]

  def destroy
    @note.destroy
---
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 1]]

    def set_note
      @note = Note.find_by(params[:slug])
---
SELECT  "notes".* FROM "notes" WHERE (q9iikm3GeKp0kSssYuGmhw) LIMIT $1  [["LIMIT", 1]]