app/controllers/notes_controller.rb

DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 77]]
---
  def show
	@note = Note.find_by slug: params[:slug]
	if @note.nil?
		render "note deleted"
	else
		@note.destroy